src/main/resources/org/dpctl/stylesheets/soma/actions/domain-quiesce.xsl

<?xml version="1.0" encoding="UTF-8"?>
<xsl:stylesheet
    version="1.0"
    xmlns:xsl="http://www.w3.org/1999/XSL/Transform"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:mgmt="http://www.datapower.com/schemas/management"
    xmlns:dpctl="http://www.dpctl.org/"
    dpctl:category="SOMA Actions"
    dpctl:doc="Domain quiesce action"
    exclude-result-prefixes="xsl dpctl">
  <xsl:output method="xml" encoding="UTF-8" omit-xml-declaration="no" media-type="text/xml"/>

  <xsl:param name="domain" dpctl:doc="DataPower domain"/>
  <xsl:param name="timeout" dpctl:doc="Length of time in seconds to wait for all transactions to complete"/>
  <xsl:param name="delay" dpctl:doc="Interval of time in seconds to wait before initiating the quiesce action"/>

  <xsl:template match="/">
    <soap:Envelope>
      <soap:Body>
        <mgmt:request domain="{$domain}">
          <mgmt:do-action>
            <DomainQuiesce>
              <name><xsl:value-of select="$domain"/></name>
              <timeout><xsl:value-of select="$timeout"/></timeout>
              <delay><xsl:value-of select="$delay"/></delay>
            </DomainQuiesce>
          </mgmt:do-action>
        </mgmt:request>
      </soap:Body>
    </soap:Envelope>
  </xsl:template>
</xsl:stylesheet>
